{
	"configuration": {
		"title": "Nuit",
		"subtitle": "Une brève nouvelle interactive, par Richard Legrand",
		"title-background-color": "black",
		"start": "start",
		"next-text": "Continuer...",
		"text-color": "white",
		"background-color-bottom": "#222",
		"background-color-top": "#888",
		"background-image": "img/smoke.png",
		"background-image-opacity": "0.66",
		"background-image-animation-duration": "40s",
		"sequence-animation-duration": "600"
	},

	"sequences": {
		"start": {
			"text": [
				"La nuit avait étendu ses bras sur le monde. Pour chacun, son obscurité recellait une différente promesse suavement murmurée : celle de ténébreux mystères ; celle de douces tentations ; celle de périlleux dangers ; celle d'inavoués secrets... Son horizon de velours noir était brodé d'infinies possibilités, car en s'engouffrant entre les portes du soir, nul ne savait ce qu'il y rencontrerait.",
				"C'est là que tu cheminais, sous le ciel nocturne et les lumières artificielles de la ville s'étendant autour de toi. Tes pas claquaient contre le sol de bitume, encore incertains du trajet qui serait le leur en cette nuit..."
				],
			"animation-duration": "1200",
			"choices": [
				{
					"text": "Vers les grandes avenues baignées de lumière.",
					"destination": "avenues"
				},
				{
					"text": "Vers les modestes ruelles nimbées de pénombre.",
					"destination": "ruelles"
				}
			]
		},
		"avenues": {
			"text": "Tes pas te portent jusqu'aux larges arterres principales, emplies de lumière et de vie. Là, le coeur battant de la ville continue à frémir malgré l'heure tardive. Dans ces beaux quartiers se cotoient la beauté sans âge des monuments historiques, et celle bourgeonnante qui se presse dans les lieux de rencontre à la mode... Gloires passées d'un côté, délices éphémères de l'autre.",
			"choices": [
				{
					"text": "Se mêler aux lieux grouillants de vie.",
					"destination": "mondain"
				},
				{
					"text": "Se diriger vers les calmes monuments.",
					"destination": "monuments"
				}
			]
		},
		"mondain": {
			"text": "Les trottoires des rues les plus huppées sont éclairés d'enseignes chatoyantes, néons et LED clignotantes, portant sur la vie nocturne une lumière qui ne dort jamais. Sous cet éclat artificiel se presse une foule parée de ses atours les plus élégants ou les plus aguicheurs : robes en sequins, chemises entrouvertes, jambes de nylon, montres rutilantes... Une éternelle jeunesse désireuse de croquer les fruits de la nuit promis derrière des portes bien défendues.",
			"choices": [
				{
					"text": "Se laisser guider par la musique jusqu'à une discothèque branchée.",
					"destination": "discotheque"
				},
				{
					"text": "Passer les battants d'un café animé.",
					"destination": "cafe"
				},
				{
					"text": "Préférer l'ambiance plus feutrée d'un palace très select.",
					"destination": "palace"
				}
			]
		},
		"discotheque": {
			"text": [
				"L'entrée de la boîte de nuit est semblable à une tanière : sombre, moite, grondante... Tu te faufiles entre d'indéfinissables silhouettes et suis la vibration sonore afin d'atteindre le coeur de ce sanctuaire nocturne.",
				"Tu y es accueilli par un assourdissant battement de basses, résonnant entre les murs jusqu'en ta cage thoracique. Nombreux sont ceux venus s'abandonner ici à la pulsation puissante de la musique, et tu aperçois, lorsqu'un éclat de projecteur vient briser la pénombre ambiante, la masse dansante des corps entassés sur le dancefloor. Celui-ci occupe la plus grande partie de la large salle dégagée, laissant simplement la place pour un comptoir de bar bondé et un discret escalier menant à ce qui doit être le carré VIP."
			],
			"choices": [
				{
					"text": "Rejoindre à son tour la piste de danse.",
					"destination": "discotheque-danse"
				},
				{
					"text": "Se frayer un chemin jusqu'au bar.",
					"destination": "discotheque-bar"
				},
				{
					"text": "Grimper les escaliers vers le carré VIP.",
					"destination": "discotheque-vip"
				}
			],
			"comment": "Hédoniste, vampire, sexe, meurtrier, MC"
		},
		"discotheque-danse": {
			"text": "L'éclat fugace d'un regard entraperçu sous l'éclairage d'un stroboscope",
			"choices": [
				{
					"text": "",
					"destination": ""
				},
				{
					"text": "",
					"destination": ""
				}
			],
			"comment": "Sexe, vampire, hédoniste"
		},
		"discotheque-bar": {
			"text": "Il te faut quelque peu jouer des coudes avant d'accéder toi-même au comptoir, ",
			"choices": [
				{
					"text": "",
					"destination": ""
				},
				{
					"text": "",
					"destination": ""
				}
			],
			"comment": "Sexe, MC, meurtrier (GHB ?)"
		},
		"discotheque-vip": {
			"text": "Dédaignant l'amas humain occupant ce lieu bondé, tu le contournes ",
			"choices": [
				{
					"text": "",
					"destination": ""
				},
				{
					"text": "",
					"destination": ""
				}
			],
			"comment": "Vampire, élite"
		},
		"cafe": {
			"text": [
				"A peine as-tu pénétré dans le café que tu es assailli de bruit de centaines de voix, de rires, de conversations. Nombreux sont ceux ici attablés, soient-ils des bandes d'amis appréciant insouciemment ce moment partagé ensemble ; des couples cherchant à s'apprivoise l'un-l'autre ; ou des quidams occupés à refaire le monde autour d'un verre...",
				"Un serveur fort occupé te guide, entre deux commandes, jusqu'à l'une des rares tables encore inoccupée de l'établissement, où tu t'assois sous un mur occupé par une élégante fresque en verre peint, près d'un groupe entretenant un débat animée. Tu remarques non loin un piano droit, fermé et innocupé, sans doute utilisé lors de soirées d'improvisation musicale. Le serveur glisse un menu sur la table puis s'éloigne pour retourner à sa besogne."
			],
			"choices": [
				{
					"text": "Sélectionner un bon cru sur leur carte des vins, à déguster en admirant les lieux.",
					"destination": "cafe-vin"
				},
				{
					"text": "Commander une bière et s'intéresser à la discussion de la table voisine.",
					"destination": "cafe-debat"
				},
				{
					"text": "Se glisser jusqu'au piano pour en tirer quelques notes.",
					"destination": "cafe-piano"
				}
			],
			"comment": "Hédoniste, révolution"
		},
		"cafe-vin": {
			"text": "Un verre millésimé soigneusement choisi à la main, tu laisses ton regard couler sur la décoration de l'endroit. Les tables, luminaires et fresques laissent transparaître une inspiration Art Nouveau évoquant le début du XXe siècle, avec de délicates dorures métalliques en arabesque ou une reproduction sur verre d'une peinture de Mucha...",
			"choices": [
				{
					"text": "",
					"destination": ""
				},
				{
					"text": "",
					"destination": ""
				}
			],
			"comment": "Hédoniste, élite"
		},
		"cafe-debat": {
			"text": "Principal enjeu de société.",
			"choices": [
				{
					"text": "La résistance à l'opression !",
					"destination": ""
				},
				{
					"text": "Le combat face à l'injustice !",
					"destination": ""
				},
				{
					"text": "La lutte contre l'insécurité !",
					"destination": ""
				},
				{
					"text": "Whatever bro.",
					"destination": ""
				}
			]
		},
		"cafe-piano": {
			"text": "",
			"choices": [
				{
					"text": "",
					"destination": ""
				},
				{
					"text": "",
					"destination": ""
				}
			]
		},
		"palace": {
			"comment": "Hédoniste, riche, vampire"
		},
		"monuments": {
			"text": "Tandis que tu marches sur les pavés des quartiers historiques, l'agitation habituelle de la ville laisse place à un calme silence où seuls tes pas résonnent entre les murs de pierre en cette heure avancée. Ici, les architectures éclectiques témoignent solennellement des différentes strates d'Histoire sur lesquelles s'est construit ce petite morceau de civilisation, s'offrant au regard et à l'exploration.",
			"choices": [
				{
					"text": "Franchir le portail d'une vieille église.",
					"destination": "eglise"
				},
				{
					"text": "Musée / Museum ?"
				},
				{
					"text": "Entrer en un hôtel particulier devenu restaurant de luxe",
					"destination": "palace"
				}
			],
			"comment": "Riche, vampire, fantôme, fugitif"
		},
		"eglise": {
			"comment": "Meurtrier, fugitif, fantôme, vampire"
		},
		"ruelles": {
			"text": "Ici, un autre visage de la ville se dessinait en clair-obscur.",
			"choices": [
				{
					"text": "Se mêler à la foule",
					"destination": "populace"
				},
				{
					"destination": "solitude"
				}
			]
		},
		"populace": {
			"choices": [
				{
					"destination": "discotheque"
				},
				{
					"destination": "tripot"
				},
				{
					"destination": "groupe"
				},
				{
					"destination": "cybercafe"
				},
				{
					"destination": "metal"
				}
			]
		},
		"solitude": {
			"choices": [
				{
					"text": "Franchir le portail d'une vieille église.",
					"destination": "eglise"
				},
				{
					"destination": "mendiant"
				},
				{
					"destination": "agression"
				}
			],
			"comment": "Fugitif, meurtrier, fantôme, justicier"
		}
	}
}